Repository: kstep/procalc
Catalog: i18n/*/LC_MESSAGES/procalc.po
Languages: ru

source: Auto
ru: Авто

source: Base exp
ru: Мантисса+экспонента

source: Normal
ru: Нормальный

source: Raw
ru: Машинный

source: Automatic (accel)
ru: Авто (аксел.)

source: Automatic (slider)
ru: Авто (слайдер)

source: Landscape
ru: Ландшафтная

source: Portrait
ru: Портретная

source: Empty value
ru: Нет значения

source: Stack is empty
ru: Стек пуст

source: View mode
ru: Режим

source: Precision
ru: Точность

source: Orientation
ru: Ориентация

source: About
ru: О программе

source: Programmer's calculator, v%(version)s RPN calculator with bit-wise operations and infix operators emulation. Distributed AS IS under GPLv3 or greater without any warranty. Author: Konstantin Stepanov, (c) 2010
ru: Калькулятор для программиста, v%(version)s RPN-калькулятор с побитовыми операциями и эмуляцией инфиксных операторов. Распространяется КАК ЕСТЬ под лицензией GPLv3 или выше без каких либо гарантий. Автор: Константин Степанов, © 2010

source: Press 2, 8, 0 or A to select base
ru: Нажмите 2, 8, 0 или A для выбора системы счисления

source: Arguments type mismatch for %s(%s)
ru: Некорректные типы аргументов для операции %s(%s)

source: Argument type mismatch for %s(%s, ...)
ru: Некорректный тип аргумента для операции %s(%s, ...)

source: Unknown operation %s
ru: Неизвестная операция %s

source: No empty values allowed on the stack
ru: Пустые значения в стеке недопустимы
